def printMiniSodoku(a):
    # ทำให้มันปริ้นแบบนี้
    # 8  4  1  9  2  4  1  3  5
    # 6  3  9  6  8  1  7  9  2
    # 5  2  7  3  5  7  4  6  8
    # 2  4  6  3  5  7  4  6  8
    # 8  1  3  9  2  4  1  3  5
    # 5  7  9  6  8  1  7  9  2
    # 5  7  9  6  8  1  7  9  2
    # 2  4  6  3  5  7  4  6  8
    # 8  1  3  9  2  4  1  3  5
    pass

def readMiniSodoku(a):
    # อ่านไฟล์
    pass

def printSubGrid(a):
    subG = ""
    qa = int(len(a)**(0.5))
    for i in range(qa):
        for j in range(qa*i,qa*i+qa):
            subG = subG + a[j] + " "
        if i < qa-1:
            subG = subG + "\n"
    return subG

def checkMiniSodoku(a):

    # Sudoku ย่อย คือ Sudoku ที่มีขนาดเป็น รากที่สองของขนาดทั้งหมด เช่น
    # 8  4  1 | 9  2  4 | 1  3  5
    # 6  3  9 | 6  8  1 | 7  9  2
    # 5  2  7 | 3  5  7 | 4  6  8
    # ----------------------------
    # 2  4  6 | 3  5  7 | 4  6  8
    # 8  1  3 | 9  2  4 | 1  3  5
    # 5  7  9 | 6  8  1 | 7  9  2
    # ----------------------------
    # 5  7  9 | 6  8  1 | 7  9  2
    # 2  4  6 | 3  5  7 | 4  6  8
    # 8  1  3 | 9  2  4 | 1  3  5
    # มีขนาด 9x9 ดังนั้นแต่ละ Sudoku ย่อย จะมีขนาด 3x3

    # Check ว่าเป็นไปตามกฎไหม
    # 1.Sudoku ย่อย ต้องมีเลขไม่ซ้ำกัน
    # 2.ต้องไม่มี Sudoku ย่อย ไหนที่เหมือนกัน

    # ถ้าผ่านใน 2 ข้อนี้ให้คืนคำว่า "True" ออกมา
    # ถ้าไม่ผ่าน ให้ปริ้นออกมาว่าไม่ผ่านในข้อไหน และปริ้น Sudoku ย่อย ตัวนั้นออกมา
    # ตัวอย่าง Testcase
    # Example 01 ========================
    #13 10 3  8  14 3  8  13 15 4  9  14 16 5  10 15
    # 9  2  7  16 2  7  12 1  3  8  13 2  4  9  14 3
    # 1  6  15 12 6  11 16 5  7  12 1  6  8  13 2  7
    # 5  14 11 4  10 15 4  9  11 16 5  10 12 1  6  11
    # 1  6  11 16 2  7  12 1  3  8  13 2  4  9  14 3
    # 5  10 15 4  6  11 16 5  7  12 1  6  8  13 2  7
    # 9  14 3  8  10 15 4  9  11 16 5  10 12 1  6  11
    # 13 2  7  12 14 3  8  13 15 4  9  14 16 5  10 15
    # 5  10 15 4  6  11 16 5  7  12 1  6  8  13 2  7
    # 9  14 3  8  10 15 4  9  11 16 5  10 12 1  6  11
    # 13 2  7  12 14 3  8  13 15 4  9  14 16 5  10 15
    # 1  6  11 16 2  7  12 1  3  8  13 2  4  9  14 3
    # 1  6  11 16 2  7  12 1  3  8  13 2  4  9  14 3
    # 13 2  7  12 14 3  8  13 15 4  9  14 16 5  10 15
    # 9  14 3  8  10 15 4  9  11 16 5  10 12 1  6  11
    # 5  10 15 4  6  11 16 5  7  12 1  6  8  13 2  8
    # fail test#1!
    # 4 9 14 3
    # 16 5 10 15
    # 12 1 6 11
    # 8 13 2 8
    # Example 02 ========================
    # 8  4  1  9  2  4  1  3  5
    # 6  3  9  6  8  1  7  9  2
    # 5  2  7  3  5  7  4  6  8
    # 8  1  3  9  2  4  1  3  5
    # 5  7  9  6  8  1  7  9  2
    # 2  4  6  3  5  7  4  6  8
    # 5  7  9  6  8  1  7  9  2
    # 2  4  6  3  5  7  4  6  8
    # 8  1  3  9  2  4  1  3  5
    # fails test#2!
    # 9 2 4
    # 6 8 1
    # 3 5 7
    # ========================
    pass

# ================================================================
# พยายามอย่าแก้ข้อมูลตั้งแต่บรรทัดนี้
fn = input('Enter Minisodoku0X.txt: ') # แต่ถ้าตอนทำจะเปลี่ยน input เป็น string ชื่อไฟล์เลยก็ได้ จะได้ไม่ต้องเขียนเยอะ
s = readMiniSodoku(fn)
print('Running Sudoku')
printMiniSodoku(s)
res = checkMiniSodoku(s)
print(res)

